Revit 2027 API
RebarSplice.RotateRebarSpliceGeometry Method
 Rotates the RebarSpliceGeometry about the given axis and angle.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RotateRebarSpliceGeometry(
	Line axis,
	double angle
)
Public Sub RotateRebarSpliceGeometry (
	axis As Line,
	angle As Double
)
public:
void RotateRebarSpliceGeometry(
	Line^ axis,
	double angle
)
member RotateRebarSpliceGeometry :
        axis : Line *
        angle : float -> unit
Parameters
axis Line
 The axis of rotation.
angle Double
 The angle of the rotation in radians.
Exceptions
Exception | Condition
ArgumentException |  The given value for angle is not finite
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarSplice Class
Autodesk.Revit.DB.Structure Namespace